import { ProfileLang } from "./types";

export const profileAr: ProfileLang = {
  companyFieldTitle: "مجال عمل الشركة",
  companyFieldText: "التطوير والاستثمار فى القطاع العقاري.",

  aboutTitle: "نبذة عنا",
  aboutParagraphs: [
    "تأسست شركة الجادة الأولى للتطوير العقاري كشركة ذات مسؤولية محدودة فى مدينة الرياض برأس مال قدره 500 ألف ريال سعودي عام 2017، وبعد ثلاثة أعوام تحولت الشركة من شركة ذات مسؤولية محدودة إلى شركة مساهمة مقفلة.",
    "تقدم الشركة أعمالها من خلال قطاعين رئيسيين وهما قطاع الاستثمار العقاري والمتمثل فى أنشطة شراء وبيع الأراضي والعقارات وتقسيمها، وقطاع المقاولات حيث يتمثل فى أنشطة الإنشاءات العامة للمباني السكنية والغير سكنية. حيث يتمثل نشاط الشركة الحالي فى التطوير والاستثمار فى القطاع العقاري وإنشاء الوحدات السكنية والتجارية، وتعتمد الشركة فى إيراداتها بشكل كبير على قطاع الاستثمار العقاري."
  ],

  basicInfoTitle: "معلومات أساسية",
  basicInfo: [
    { label: "نوع الملكية", value: "مساهمة عامة" },
    { label: "الدولة", value: "المملكة العربية السعودية" },
    { label: "سنة التأسيس", value: "2017" },
    { label: "الهاتف", value: "+966 55 850 6969" },
    {
      label: "الموقع الإلكترونى",
      value: "www.the1stavenue.com.sa",
      link: "https://www.the1stavenue.com.sa"
    },
    { label: "تليفون", value: "+966 11 203 3116" },
   {
    label: "البريد الإلكترونى",
    value: "IR@The1stAvenue.com",
    link: "mailto:IR@The1stAvenue.com", full: true 
  },
  {
    label: "العنوان",
    value:
      "مبنى رقم 3718 - جادة المحمدية الدور الأول شارع خليفة بن بديع – حي المحمدية - الرياض 12363", full: true 
  },
  { label: "صندوق البريد", value: "2447" , full: true }
  ],

  sectorsTitle: "قطاعات وأرقام",
  numbers: [
    { label: "سوق التداول", value: "نمو" },
    { label: "نهاية السنة المالية", value: "ديسمبر" },
    { label: "الأسهم الحرة (مليون)", value: "140.88" },
    { label: "الأسهم الحرة %", value: "68.72" },
    { label: "وزن الشركة", value: "4.05" },
    { label: "متوسط حجم التداول (سهم) لآخر 3 أشهر", value: "151,990.14" }
  ],

  stats: [
    { label: "متوسط عدد الصفقات اليومية لآخر 3 أشهر", value: "34.21" },
    { label: "التغيير (12 شهر) %", value: "-" }
  ],

  financialSummaryTitle: "ملخص النتائج المالية",
  tableHeaders: ["البيان", "تشارت", "2024", "2023", "2022", "2021", "2020"],

  financialRows: [
    {
      title: "الإيرادات",
      sar: ["254.95", "237.85", "204.65", "204.92", "70.49"],
      usd: ["67.99", "63.43", "54.57", "54.64", "18.80"]
    },
    {
      title: "صافي الدخل",
      sar: ["59.30", "41.95", "42.71", "50.61", "16.03"],
      usd: ["15.81", "11.19", "11.39", "13.50", "4.27"]
    },
    {
      title: "مجموع الموجودات",
      sar: ["960.10", "500.69", "428.43", "195.30", "155.36"],
      usd: ["256.03", "133.52", "114.25", "52.08", "41.43"]
    },
    {
      title: "حقوق المساهمين",
      sar: ["529.81", "328.24", "281.75", "121.49", "22.11"],
      usd: ["141.28", "87.53", "75.13", "32.40", "5.89"]
    }
  ],

  shareDataTitle: "(أخر فترة مالية) بيانات السهم",
  shareDataSAR: [
    { label: "عدد الأسهم (مليون)", value: "205" },
    { label: "القيمة الإسمية (ريال)", value: "1.02" },
    { label: "القيمة الدفترية للسهم (ريال)", value: "3.02" },
    { label: "القيمة السوقية (مليون)", value: "4,818.45" }
  ],
  shareDataUSD: [
    { label: "عدد الأسهم (مليون)", value: "205" },
    { label: "القيمة الإسمية (دولار)", value: "0.27" },
    { label: "القيمة الدفترية للسهم (دولار)", value: "0.79" },
    { label: "القيمة السوقية (مليون)", value: "1,248.45" }
  ],

  subsidiariesTitle: "الشركات التابعة والزميلة",
  subsidiariesHeaders: ["الشركة", "الدولة", "النسبة"],
  subsidiaries: [
    { name: "صندوق جدوى كابيتال افنيو العقاري", country: "المملكة العربية السعودية", percent: "100.00 %" },
    { name: "شركة جادة البحر العقارية", country: "المملكة العربية السعودية", percent: "50.00 %" },
    { name: "صندوق لابيرل العقاري", country: "المملكة العربية السعودية", percent: "42.66 %" },
    { name: "صندوق الجادة كابيتال الاستثماري", country: "المملكة العربية السعودية", percent: "24.27 %" },
    { name: "صندوق بلوم للاستثمار العقاري 1", country: "المملكة العربية السعودية", percent: "100.00 %" },
    { name: "صندوق جادة الدرعية للاستثمار", country: "المملكة العربية السعودية", percent: "37.89 %" }
  ],


  shareholdersTitle: "كبار المساهمين",
  shareholdersHeaders: ["الإسم", "نسبة الملكية", "عدد الأسهم (مليون)"],
  shareholders:  [
    { name: "نادر بن حسن العمري", percent: "57.61%", shares: "28.10" },
    { name: "شركة مكة للإنشاء والتعمير", percent: "56.83%", shares: "27.72" },
    { name: "شركة دار الماجد العقارية", percent: "18.86%", shares: "9.20" }
  ],

  developmentsTitle: "التطورات الرئيسية",
developments: [
  {
    date: "22-12-2025",
    text: "استحوذت الشركة على مشروع برج جادة الأعمال – القيروان من خلال شراء حصص الشركاء في صندوق المشروع جدوى كابيتال افنيو العقاري."
  },
  {
    date: "16-10-2024",
    text: "إدراج وبدء تداول أسهم الشركة فى سوق نمو"
  },
  {
    date: "7-6-2023",
    text: "تجزئة القيمة الاسمية للسهم من 10 ريالات للسهم الواحد إلى ريال واحد للسهم الواحد ليصبح عدد أسهم الشركة 113.627 مليون سهم بدلاً من 11.36 مليون سهم، وزيادة رأس مال الشركة من 113.627 مليون ريال سعودي إلى 188.576 مليون ريال سعودي عن طريق إصدار أسهم جديدة من خلال رسملة حساب علاوة الإصدار."
  },
  {
    date: "22-11-2022",
    text: "زيادة رأس مال الشركة من 100 مليون ريال سعودي إلى 113.627 مليون ريال سعودي عن طريق إصدار أسهم جديدة."
  },
  {
    date: "13-9-2021",
    text: "زيادة رأس مال الشركة من 45 مليون ريال سعودي إلى 100 مليون ريال سعودي عن طريق إصدار أسهم منحة."
  }
],


  buttons: {
    more: "المزيد",
    indicators: "المؤشرات المالية"
  },

  currency: {
    sar: "ريال",
    usd: "دولار"
  }
};
